chapter_05/rails/ratings-service/app/controllers/votes_controller.rb

  def create
    begin
      value = Yajl::Parser.parse(request.body.read)

      vote = Vote.create_or_update(
        :user_id => params["user_id"],
        :entry_id => params["entry_id"],
        :value => value)
---
INSERT INTO "votes" ("entry_id", "created_at", "updated_at", "user_id", "value") VALUES('45', '2009-09-21 21:05:07', '2009-09-21 21:05:07', '3', 1)

  def entry_ids_voted_up_for_user
    page      = (params[:page] || 1).to_i
    per_page  = (params[:per_page] || 25).to_i
    user_id   = params[:user_id]
    count     = Vote.up.user_id(user_id).count
---
SELECT count(*) AS count_all FROM "votes" WHERE ((user_id = '4') AND (value = 'up'))

  def entry_ids_voted_down_for_user
    page      = (params[:page] || 1).to_i
    per_page  = (params[:per_page] || 25).to_i
    user_id   = params[:user_id]
    count     = Vote.down.user_id(user_id).count
---
SELECT count(*) AS count_all FROM "votes" WHERE ((user_id = '4') AND (value = 'down'))

  def totals_for_entries
    entry_ids = params["ids"].split(",")

    data = entry_ids.inject({}) do |result, entry_id|
      result.merge!(entry_id => {
        :up   => Vote.up.entry_id(entry_id).count,
        :down => Vote.down.entry_id(entry_id).count
      })
---
SELECT count(*) AS count_all FROM "votes" WHERE ((entry_id = NULL) AND (value = 'up'))

  def votes_for_users
    user_id   = params["user_id"]
    entry_ids = params["ids"].split(",")

    data = entry_ids.inject({}) do |result, entry_id|
      vote = Vote.find_by_user_id_and_entry_id(user_id,
        entry_id)
---
SELECT * FROM "votes" WHERE ("votes"."user_id" = '4' AND "votes"."entry_id" = '45') LIMIT 1

  def totals_for_user
    user_id = params["user_id"]

    data = {
      :up   => Vote.up.user_id(user_id).count,
      :down => Vote.down.user_id(user_id).count
---
SELECT count(*) AS count_all FROM "votes" WHERE ((user_id = '3') AND (value = 'down'))